"""
示例一
对用户输入的数据进行处理，并构成字典
info = {"huangtianyi":123}

要求：
1.输入q/Q,则终止
2.输入文本构造字典
3.输出字典中的所有键值对
"""
# info = {}
# while True:
#     username = input("请输入你的用户名(q/Q)：")
#     if username.upper() == "Q":
#         break
#     if not info.get(username):
#         password = input("请输入你的密码：")
#         info.setdefault(username, password)
#         # info[username] = password
#     else:
#         print("请重新输入用户名")
# print(info)

info = {}
while True:
    user_input = input("请输入你的用户名和密码(q/Q)：")  # admin,123
    if user_input.upper() == "Q":
        break
    user_list = user_input.split(",")
    # info.setdefault(user_list[0], user_list[1])
    info[user_list[0]] = user_list[1]

for k, v in info.items():
    print(k, v)

"""
示例二
输出所有的列表，用户输入序号，显示用户选择的商品

商品列表
goods = [
    {"name": "电脑", "price": 1999},
    {"name": "鼠标", "price": 10},
    {"name": "游艇", "price": 20},
    {"name": "飞机", "price": 80},
]

要求：
1.输出序号
  0 电脑 1999
  1 鼠标 10
  2 游艇 20
  3 飞机 80
2.输出序号
  1 电脑 1999
  2 鼠标 10
  3 游艇 20
  4 飞机 80
3.用户输入序号：1,输出对应位置的商品信息(从一开始，而不是下标0)
  "您购买的商品是xxx,价格是xx"
"""
goods = [
    {"name": "电脑", "price": 1999},
    {"name": "鼠标", "price": 10},
    {"name": "游艇", "price": 20},
    {"name": "飞机", "price": 80},
]

# 1.输出序号
for key in range(len(goods)):
    good = goods[key]
    print(f"{key} {good['name']} {good['price']}")

# 2.输出序号
for key in range(len(goods)):
    good = goods[key]
    print(f"{key + 1} {good['name']} {good['price']}")

# 3.用户输入序号
while True:
    user_key = input("请选择你需要购买的商品的序号:")
    if user_key.isdecimal():
        user_key = int(user_key)
        if 0 < user_key <= len(goods):
            sel_good = goods[user_key - 1]
            print(f"您购买的商品是{sel_good['name']},价格是{sel_good['price']}")
            break
        else:
            print("没有该商品，请重新输入")
    else:
        print("请输入数字")

"""
实例三 看代码
"""
# 嵌套
info = {"k1": [11, 22, 33], "k2": [44, 55, 66, 9999]}
info["k1"]  # [11, 22, 33]
info["k1"][-1]  # 33
info["k2"].append(999)

# 判断是否有这个键值 in
info = {"k1": 123, "k2": 88}
if "k1" in info:
    pass

info = {}
if "k1" in info:
    pass
else:
    info["k1"] = [123]
if "k1" in info:
    info["k1"].append("8888")  # {'k1': [123, '8888']}
else:
    pass


data_list = [11, 22, 33, 44, 55, 66, 77, 88]

result = {
    "k1": [],
    "k2": [],
}
# <50以下加入到k1,>=50加入到k2
for item in data_list:
    if item < 50:
        result["k1"].append(item)
    else:
        result["k2"].append(item)

result  # {'k1': [11, 22, 33, 44], 'k2': [55, 66, 77, 88]}

"""
输出data_list的所有城市，将同一省份下的名字组成一个字典
"""
data_list = [
    ["王*龙", "北京市,海淀区", "苏州街大恒科技大厦南座4层"],
    ["庞*飞", "北京市,昌平区", "汇德商厦四楼403"],
    ["顾*锐", "江苏省,扬州市", "三垛镇工业集中区扬州市立华畜禽有限公司"],
    ["王*飞", "上海市,徐汇区", "上海市徐汇区H88越虹广场B座5E"],
    ["华*升", "北京市,海淀区", "杰睿大厦"],
    ["朱*锴", "上海市,浦东新区", "川沙新镇华川家园33号楼503"],
    ["陈*盼", "浙江省,杭州市", "闲林街道,西溪华东园,十幢一单元401。"],
    ["司*鹏", "河南省,鹤壁市", "淇滨大道310号  鹤壁京立医院"],
    ["聂*睿", "河北省,石家庄市", "中山路勒泰中心写字楼b座11层"],
    ["张*", "辽宁省,本溪市", "明兴丽城九号楼四单元"],
    ["冉*晗", "河北省,石家庄市", "体育南大街385号"],
    ["高*杰", "北京市,朝阳区", "广渠路42号院3号楼,408"],
    ["李*国", "安徽省,合肥市", "新站区淮合花园"],
    ["常*源", "江苏省,南京市", "白下路242号,南京市红十字医院,放射科"],
    ["张*玉", "河北省,沧州市", "新居然家居广场"],
    ["王*川", "上海市", "奉贤区南桥镇 贝港七区"],
    ["魏*飞", "河北省,石家庄", "市新石北路与红旗大街交口开元大厦502室"],
    ["张*", "山东省,济南市", "兴港路三庆城市主人"],
    ["段*琪", "山西省,临汾市", "福利路尧乡小区"],
    ["刘*", "北京市", "昌平区龙禧三街骊龙园601"],
    ["王*生", "上海市", "杨浦区邯郸路复旦大学遗传学楼319室"],
    ["王*君", "江苏省,扬州市", "叶挺路318号建行营业部"],
    ["王*义", "北京市", "东城区环球贸易中心D座"],
    ["李*", "陕西省,汉中市", "同沟寺镇晨光村二组"],
    ["裴*宇", "吉林省四平市", "岭西新耀豪庭7栋"],
    ["丁*", "山东省烟台市", "大季家镇芦洋村"],
    ["刘*铎", "黑龙江省佳木斯市", "火电小区桥头浴池附近惠惠干洗店"],
    ["梁*升", "吉林省吉林市", "承德街45号吉林化工学院"],
    ["陈*龙", "上海市", "浦东新区郭守敬路498号23号楼23215"],
    ["张*", "上海市", "徐汇区桂林路402号 诚达创意园76幢407室 银基科技"],
    ["何*畅", "河南省周口市", "西华县箕城高中"],
    ["欧*", "北京市", "丰台区东营里5号院8号楼2单元401"],
    ["陶*", "安徽省宣城市", "鳌峰东路180号宣城皖南农商银行413室"],
    ["艾*麦提江·拜克热", "浙江省杭州市", "浦沿街道江畔云卢4幢2单元1202"],
    ["王*", "上海市", "浦东新区福山路455号,全华信息大厦,1楼,平安银行"],
    ["刘*林", "湖北省宜昌市", "枝城镇大堰村四组"],
    ["罗*", "河南省信阳市", "西关黄国新城C6"],
    ["莫*", "河南省郑州市", "金水区76号9202"],
    ["徐*龙", "安徽省合肥市", "长江西路新加坡花园城4联排"],
]

result = {}
for item in data_list:
    name = item[0]
    city = item[1].split(",")[0]
    if city in result:
        result[city].append(name)
    else:
        result[city] = [name]

print(result)
