"""
嵌套

容器：元组，列表，字典（键可哈希）

字典的键必须可哈希（list/set/dict不可哈希）
字典的值可以是任意类型。
字典的键和集合的元素在遇到 布尔值 和 1、0 时，需注意重复的情况。
"""
info = {
    "k1": 123,
    "k2": (11, 22, 33),
    "k3": [11, 22, 3],
    "k4": [11, 22, 3, {"v1": 123, "v2": 456}],
}

info = {(11, 22): 123}

# 错误 -> 和集合一样，无论是否嵌套，key内的值都必须可哈希
# info = {
#     (11,[11,22,],22):"alex"
# }

# 字典的值可以是任意类型。

info = {"k1": {12, 3, 5}, "k2": {"xx": "x1"}}


"""
案例一 以下哪些值不能作为字典的键
"""
a = 1
b = -2
c = ""
d = None
e = [1, 2]  # 报错
f = (1,)
g = {"k1": "v1", "k2": "123"}  # 报错
