"""
三种字符串格式化 
format (推荐)、%、f-string
"""


# format (推荐)
# 基本用法（下标的方式）
text = "今天是{0}号,天气{1}".format("6", "晴")
print(text)  # 今天是6号,天气晴

# 可以替换相同变量
text = "今天是{0}号,天气{1},明天天气还是{1}".format("6", "晴")
print(text)  # 今天是6号,天气晴,明天天气还是晴

# 可以默认不写，从 0 1 2 开始
text = "今天是{}号,天气{},明天天气还是{}".format("6", "晴", "晴")
print(text)  # 今天是6号,天气晴,明天天气还是晴

# 字符串模板作为变量，方便赋值
tpl = "今天是{}号,天气{}"
v1 = tpl.format("6", "晴")
print(v1)  # 今天是6号,天气晴
v2 = tpl.format("7", "大暴雨")
print(v2)  # 今天是7号,天气大暴雨

"""
注意 
可以通过变量形式进行赋值操作
"""
text = "今天是{n1}号,天气{xx},明天天气是{p2}".format(n1="6", xx="晴", p2="大暴雨")
print(text)  # 今天是6号,天气晴,明天天气是大暴雨
