"""
data = ["京A83322","沪B88112","黑A88792"]

1. 获取所有京牌的车牌并放到一个列表中
2. 输出列表：再输出京牌的个数
"""
data = ["京A83322", "沪B88112", "黑A88792"]

result = []
for i in data:
    if i.startswith("京"):
        result.append(i)

result  # ['京A83322']
len(result)  # 1

"""
创建一副扑克牌（不含大小王）

color_list = ["红桃", "梅花", "黑桃", "方片"]
num_list = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13]

获取一副扑克牌
result = [("红桃",1),("红桃",2)......,("方片",1),...("方片",13)]
"""
color_list = ["红桃", "梅花", "黑桃", "方片"]
# num_list = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13]
num_list = range(1, 14)

result = []

for color in color_list:
    for num in num_list:
        item = (color, num)
        result.append(item)

result
# [('红桃', 1), ('红桃', 2), ('红桃', 3), ('红桃', 4), ('红桃', 5), ('红桃', 6), ('红桃', 7), ('红桃', 8), ('红桃', 9), ('红桃', 10), ('红桃', 11), ('红桃', 12), ('红桃', 13),
# ('梅花', 1), ('梅花', 2), ('梅花', 3), ('梅花', 4), ('梅花', 5), ('梅花', 6), ('梅花', 7), ('梅花', 8), ('梅花', 9), ('梅花', 10), ('梅花', 11), ('梅花', 12), ('梅花', 13),
# ('黑桃', 1), ('黑桃', 2), ('黑桃', 3), ('黑桃', 4), ('黑桃', 5), ('黑桃', 6), ('黑桃', 7), ('黑桃', 8), ('黑桃', 9), ('黑桃', 10), ('黑桃', 11), ('黑桃', 12), ('黑桃', 13),
# ('方片', 1), ('方片', 2), ('方片', 3), ('方片', 4), ('方片', 5), ('方片', 6), ('方片', 7), ('方片', 8), ('方片', 9), ('方片', 10), ('方片', 11), ('方片', 12), ('方片', 13)]

"""
在同一个函数中分别使用一个参数和三个参数

不定长参数 定义
def functionname([formal_args,]*vartuple):
  "函数_文档字符串"
  function_suite
  return [expression]
"""


def printinfo(arg1, *vartuple):  # 定义函数printinfo(),参数vartuple是不定长度
    "打印任何传入的参数"
    print("输出:")
    print(arg1)
    for var in vartuple:
        print(var)
    return


printinfo(10)
# 输出:
# 10
printinfo(70, 60, 50)
# 输出:
# 70
# 60
# 50
